import math

q = 5201   # 开采水量
m = 22     # 含水层厚度
k = 57.48  # 渗透系数
a = 6323   # 导压系数
t = 365    # 开采时间
# 表格首行格式
print(f'|{"预测距离":<5}|{1:<6}|{2:<6}|{3:<6}|{4:<6}|{5:<6}|{6:<6}|{7:<6}|{8:<6}|{9:<6}|{10:<6}|')
# 补充你的代码

list = [0.5, 1, 5, 10, 20, 30, 50, 100, 200, 500, 1000, 2200]

for r in list:
    t = 365

    print(f'|{r:<8}', end = '')

    for i in range(10):
        s = q / (2 * math.pi * k * m) * math.log(2.25 * a * t / r ** 2)
        t += 365

        print(f'|{round(s, 2):<5}', end = ' ')

    print('|')
