def print_hi_human():  # 函数名用小写字母
    """文档注释，双引号，说明函数的参数、功能和返回值等。
    定义一个名为print_hi_human的无参数函数，其功能是打印一句问候语，
    这个函数没有return语句，即没有返回值，或者说其返回值为None。
    # >>> print_hi_human()
    # 人类，你好！
    """
    # ==================Begin=====================================
    print('人类，你好！')
    # ===================End====================================

if __name__ == '__main__':
    # 直接使用函数名来调用函数
    # ==================Begin=====================================
    print_hi_human()
    # ===================End====================================
