def say_hi_person(full_name):  # 函数名用小写字母，函数名填空
    """定义一个名为say_hi_person的有参数函数，接受人名的字符串为参数，函数的返回值为“***，你好！”，
    例如函数的参数为“李白”，返回值为“李白，你好！”。"""
    #====================Begin===================================
    # 补充你的代码
    return full_name + '，你好！'
    #=====================End==================================

if __name__ == '__main__':
    #  函数名作为print()函数的参数，输出say_hi_human()的返回值。输入的人名作为函数的参数
    person_name = input()              # 输入人名
    #====================Begin===================================
    # 补充你的代码
    print(say_hi_person(person_name))
    #=====================End==================================
