def say_hi_gender(full_name, gender):  # name 和gender为形式参数
    """定义一个名为say_hi的有参数函数，其功能是打印一句问候语
    根据性别gender值确定称谓，男性称为“先生”，女性称为“女士”，不确定性别时称为“先生/女士”
    返回值为替换了姓名与称谓的欢迎字符串
    例如：尊敬的李白先生，欢迎来到火星！"""
    # ====================Begin===================================
    s = ''

    if gender == '男':
        s = '先生'
    elif gender == '女':
        s = '女士'
    else:
        s = '先生/女士'

    return f'尊敬的{full_name}{s}，欢迎来到火星！'
    # =======================================================

if __name__ == '__main__':
    # 直接使用函数名来调用函数
    # ====================Begin===================================
    full_name = input()
    gender = input()

    print(say_hi_gender(full_name, gender))
    # =======================================================
